/***
*곡 정의
*****************/
#include <stdio.h>
#include <windows.h>
#include "곡_헤더1.h"

/***
*도레미파솔라시도
***************/
void Steps(void)
{
	int p = bpm();
	C(4, p);
	D(4, p);
	E(4, p);
	F(4, p);
	G(4, p);
	A(4, p);
	B(4, p);
	C(5, p);
}

/***
*학교 종이 땡땡땡
****************/
void Music1(void) {
	int  P= bpm();

	G(4, P); G(4, P); A(4, P); A(4, P);
	G(4, P); G(4, P); E(4, 2*P);//솔솔라라솔솔미

	G(4, P); G(4, P); E(4, P); E(4, P);
	D(4, 3/2*P); Sleep(P);//솔솔미미레

	G(4, P); G(4, P); A(4, P); A(4, P);
	G(4, P); G(4, P); E(4, 2 * P);//솔솔라라솔솔미

	G(4, P); E(4, P); D(4, P); E(4, P);
	C(4, 3 * P); Sleep(P);//솔솔미미레
}
/***
*작은 별
****************/
void Music2(void) {
	int p = bpm(), i;
	
	C(4, p);C(4, p);G(4, p);G(4, p);
	A(4, p);A(4, p);G(4, p*2);//도도솔솔라라솔

	F(4, p);F(4, p);E(4, p);E(4, p);
	D(4, p);D(4, p);C(4, p); Sleep(p);//파파미미레레도

	for (i = 0; i < 2; i++) {
		G(4, p); G(4, p); F(4, p); F(4, p);
		E(4, p); E(4, p); D(4, p * 2);//솔솔파파미미레
	}

	C(4, p);C(4, p);G(4, p);G(4, p);
	A(4, p);A(4, p);G(4, p * 2);//도도솔솔라라솔

	F(4, p);F(4, p);E(4, p);E(4, p);
	D(4, p);D(4, p);C(4, p);Sleep(p);//파파미미레레도
}

void Music3(void) {//저 야곱과 같이 베이스
	int p = bpm();//86bpm


	D(3, p / 2); D(3, p / 2);//1p 8마디//천지
	D(3, p / 2); D(3, p / 2); D(3, p); D(3, p);//지으신 주

	D(3, p); D(3, p); D(3, p / 2); D(3, p / 2);//솜씨 내가
	G(3, p / 2); G(3, p / 2); G(3, p); A(3, p / 2); B(3, p / 2); //묵상하오-
	B(3, p*2); /*니*/ G(3, p / 2); G(3, p / 2);//저 일


	G(3, p / 2); G(3, p / 2); G(3, p*3/2); A(3, p / 2);//2p //몰의 신비
	G(3, p / 2); D(3, p / 2); D(3, p); G(3, p / 2); A(3, p / 2);//함-도 놀라
	C(4, p / 2); B(3, p / 2); A(3, p); G(3, p);//운 주의 사

	A(3, p * 2); /*랑*/D(3, p / 2); D(3, p / 2);//가치
	D(3, p / 2); D(3, p / 2); D(3, p); D(3, p);//없는 내 삶
	D(3, p); D(3, p); D(3, p / 2); D(3, p / 2);//속에 크신

	E(3, p / 2); E(3, p / 2); E(3, p); Fs(3, p / 2); G(3, p / 2);//사랑 주 셨-
	G(3, p * 2);/*네*/ G(3, p / 2); G(3, p / 2);//온 우
	C(3, p / 2); C(3, p / 2); C(3, p); C(3, p);//주도 감당


	B(2, p); B(2, p); E(2, p / 2); E(2, p / 2);//3p//못할 측량
	A(2, p / 2); A(2, p / 2); A(2, p); A(2, p);//못할 사랑
	D(3, p * 2); Sleep(p);//을

	Sleep(p * 3);
	Sleep(p * 2); G(3, p / 2); A(3, p / 2);//내 영
	B(3, p / 2); B(3, p / 2); B(3, p * 3 / 2); D(3, p / 2);//혼의 소망

	E(3, p * 2); E(3, p / 2); E(3, p / 2);//은 삶의
	A(3, p / 2); A(3, p / 2); E(3, p); E(3, p);///모든 순간
	G(3, p); F(3, p); E(3, p / 2); E(3, p / 2);//마다 천국


	A(2, p / 2); A(2, p / 2); A(2, p); A(2, p);//4p//바라보는
	D(3, p * 5);//것
	Sleep(p / 2); D(3, p / 2);//- 내

	G(2, p / 2); G(2, p / 2); G(2, p); G(2, p / 2); G(2, p / 2);//친구 날 떠나
	G(2, p); G(2, p); Sleep(p / 2); D(3, p / 2);//가도 주
	G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2);//이름 조롱한다

	G(2, p ); G(2, p); Sleep(p / 2); G(2, p / 2);//해도 나
	E(3, p / 2); E(3, p / 2); E(3, p / 2); E(3, p / 2); E(3, p / 2); E(3, p / 2);//주의 손을 놓지
	D(3, p * 2); G(2, p);//않으


	C(3, p *3);//리
	Cs(3, p * 2); Cs(3, p);//- 저
	D(3, p / 2); D(3, p / 2); D(3, p); G(2, p);//야곱과 같

	C(3, p * 2); C(3, p);//이 나
	B(2, p / 2); B(2, p / 2); B(2, p / 2); B(2, p / 2);//주를 붙드
	E(3, p * 2); E(3, p);//니 내

	Ds(3, p / 2); Ds(3, p / 2); Ds(3, p); Ds(3, p);//주여 내게
	D(3, p); D(3, p *3/ 2); G(3, p / 2);//힘 주소
	G(3, p*5);//서


	D(3, p / 2); D(3, p / 2);//나와
	G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2); G(2, p / 2);//항상함께하소
	G(2, p / 2);/*서*/ Sleep(p / 2); G(2, p / 2);//참

	B(2, p / 2); B(2, p / 2); B(2, p); D(3, p);//평안주소
	E(3, p * 2); B(2, p / 2); B(2, p / 2);//서 나를
	C(3, p / 2); C(3, p / 2); C(3, p); B(2, p);//품어 쉐게

	A(2, p); A(2, p); D(2, p);//하옵소
	A(2, p*3);//서
}